 #2) Найти максимальное из пяти чисел

a = int(input('Введите а = '))
b = int(input('Введите b = '))
c = int(input('Введите c = '))
d = int(input('Введите d = '))
e = int(input('Введите e = '))

print(f"Максимальное число {max(a, b, c, d, e)}")