# 15. Написать программу получающую набор произведений чисел от 1 до N.
# Пример: пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

def ex15 (N):
     a = [1]
     for x in range(1, N):
         a.append(a[x - 1] * (x + 1))
     return a
 
print(ex15(10))